app/Controllers/Home.php

    protected function loadEmployees($id = null)
    {
        if(!isset($id)){
            $employee = new EmployeeModel();
            return $employee->findAll();
        }else{
            $employee = new EmployeeModel();
            return $employee->find($id);
---
SELECT *
FROM `employees`
SELECT *
FROM `employees`
WHERE `employees`.`id` = '0'

    protected function loadAccessLevels($id)
    {
        if(!isset($id)){
            $al = new AccessLevelModel();
            return $al->findAll();
---
SELECT *
FROM `access_levels`