app/Models/EmployeeModel.php

SELECT *
FROM `employees`
WHERE `email` = 'jlfaelman@gmail.com'
---
    public function authenticate ($data) {
        $db = db_connect();

        $builder = $this->db->table('employees');
        $builder->select("*");
        $builder->where("email",$data['email']);
        $query = $builder->get()->getResult();